
#### Terraform plan 📖`success`
<details>
<summary>Show plan</summary>

```[0m[1mmodule.oidc_iam_policy.data.aws_iam_policy_document.this: Reading...[0m[0m
[0m[1mmodule.oidc_provider.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::313744126666:oidc-provider/token.actions.githubusercontent.com][0m
[0m[1mmodule.oidc_iam_policy.data.aws_iam_policy_document.this: Read complete after 0s [id=1789900679][0m
[0m[1mmodule.oidc_iam_policy.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::313744126666:policy/mng-fumis-portfolio-oidc-iam-policy][0m
[0m[1mmodule.oidc_iam_role.data.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mmodule.oidc_iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3401382464][0m
[0m[1mmodule.oidc_iam_role.aws_iam_role.this: Refreshing state... [id=mng-fumis-portfolio-oidc-iam-role][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.s3_bucket_test.aws_s3_bucket.this[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "this" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "mng-fumis-portfolio-test-s3-bucket"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Name" = "mng-fumis-portfolio-test-s3-bucket"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment"        = "mng"
          [32m+[0m[0m "ManagedByTerraform" = "true"
          [32m+[0m[0m "Name"               = "mng-fumis-portfolio-test-s3-bucket"
          [32m+[0m[0m "ServiceName"        = "fumis-portfolio"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)

      [32m+[0m[0m cors_rule (known after apply)

      [32m+[0m[0m grant (known after apply)

      [32m+[0m[0m lifecycle_rule (known after apply)

      [32m+[0m[0m logging (known after apply)

      [32m+[0m[0m object_lock_configuration (known after apply)

      [32m+[0m[0m replication_configuration (known after apply)

      [32m+[0m[0m server_side_encryption_configuration (known after apply)

      [32m+[0m[0m versioning (known after apply)

      [32m+[0m[0m website (known after apply)
    }

[1m  # module.s3_bucket_test.aws_s3_bucket_public_access_block.this[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "this" {
      [32m+[0m[0m block_public_acls       = true
      [32m+[0m[0m block_public_policy     = true
      [32m+[0m[0m bucket                  = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_public_acls      = true
      [32m+[0m[0m restrict_public_buckets = true
    }

[1m  # module.s3_bucket_test.aws_s3_bucket_server_side_encryption_configuration.this[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      [32m+[0m[0m bucket = "mng-fumis-portfolio-test-s3-bucket"
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m rule {
          [32m+[0m[0m apply_server_side_encryption_by_default {
              [32m+[0m[0m sse_algorithm     = "AES256"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }
    }

[1m  # module.s3_bucket_test.aws_s3_bucket_versioning.this[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "this" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m versioning_configuration {
          [32m+[0m[0m mfa_delete = (known after apply)
          [32m+[0m[0m status     = "Enabled"
        }
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>